bitboxelectronics/R2C2_Firmware/libraries/NXP/Drivers/include/lpc17xx_usbdev.h
/***********************************************************************//**
 * @file	: lpc17xx_usbdev.h
 * @brief	: Contains all macro definitions and function prototypes
 * 				support for USB device firmware library on LPC17xx
 * @version	: 1.0
 * @date	: 15. Aug. 2008
 * @author	: LinhNguyen
 **************************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 **************************************************************************/

#ifndef LPC17XX_USBDEV_H_
#define LPC17XX_USBDEV_H_


#include "lpc_types.h"
#include "LPC17xx.h"

/* If this source file built with example, the LPC17xx FW library configuration
 * file in each example directory ("lpc17xx_libcfg.h") must be included,
 * otherwise the default FW library configuration file must be included instead
 */
#ifdef __BUILD_WITH_EXAMPLE__
#include "lpc17xx_libcfg.h"
#else
#include "lpc17xx_libcfg_default.h"
#endif /* __BUILD_WITH_EXAMPLE__ */


#ifdef __cplusplus
extern "C" {
#endif


/****************************** PRIVATE MACROS ******************************/
/** @addtogroup PRIVATE_MACROS
 * @{
 */


/* ------------------ USB Device Controller Register Bit definition --------------- */
/** @defgroup USBDEV_REGISTER_BIT_DEFINITIONS
 * @{
 */

/* USB Clock control registers ---------------------------------------------------- */
/* USB Clock Control register */
#define USBDEV_USBClkCtrl_DEV_CLK_EN				((uint32_t)(1<<1))			/**< Device clock enable */
#define USBDEV_USBClkCtrl_PORTSEL_CLK_EN			((uint32_t)(1<<3))			/**< Port select register clock enable */
#define USBDEV_USBClkCtrl_AHB_CLK_EN				((uint32_t)(1<<4))			/**< AHB clock enable */

/* USB Clock Status register */
#define USBDEV_USBClkSt_DEV_CLK_ON					((uint32_t)(1<<1))			/**< Device clock on */
#define USBDEV_USBClkSt_PORTSEL_CLK_ON				((uint32_t)(1<<3))			/**< Port select register clock on */
#define USBDEV_USBClkSt_AHB_CLK_ON					((uint32_t)(1<<4))			/**< AHB clock on */


/* USB Device interrupt registers ---------------------------------------------------- */
/* USB Interrupt Status register */
#define USBDEV_USBIntSt_USB_INT_REQ_LP				((uint32_t)(1<<0))			/**< Low priority interrupt line status */
#define USBDEV_USBIntSt_USB_INT_REQ_HP				((uint32_t)(1<<1)) 			/**< High priority interrupt line status */
#define USBDEV_USBIntSt_USB_INT_REQ_DMA				((uint32_t)(1<<2)) 			/**< DMA interrupt line status */
#define USBDEV_USBIntSt_USB_NEED_CLOCK				((uint32_t)(1<<8)) 			/**< USB need clock indicator */
#define USBDEV_USBIntSt_EN_USB_INTS					((uint32_t)(1<<31)) 		/**< Enable all USB interrupts */

/* USB Device Interrupt Status register */
#define USBDEV_USBDevIntSt_FRAME					((uint32_t)(1<<0)) 			/**< The frame interrupt occurs every 1 ms */
#define USBDEV_USBDevIntSt_EP_FAST					((uint32_t)(1<<1)) 			/**< Fast endpoint interrupt */
#define USBDEV_USBDevIntSt_EP_SLOW					((uint32_t)(1<<2)) 			/**< Slow endpoints interrupt */
#define USBDEV_USBDevIntSt_DEV_STAT					((uint32_t)(1<<3)) 			/**< Set when USB Bus reset, USB suspend change or Connect change event occurs */
#define USBDEV_USBDevIntSt_CCEMTY					((uint32_t)(1<<4)) 			/**< The command code register (USBCmdCode) is empty (New command can be written) */
#define USBDEV_USBDevIntSt_CDFULL					((uint32_t)(1<<5)) 			/**< Command data register (USBCmdData) is full (Data can be read now) */
#define USBDEV_USBDevIntSt_RxENDPKT					((uint32_t)(1<<6)) 			/**< The current packet in the endpoint buffer is transferred to the CPU */
#define USBDEV_USBDevIntSt_TxENDPKT					((uint32_t)(1<<7)) 			/**< The number of data bytes transferred to the endpoint buffer equals the number of
																					bytes programmed in the TxPacket length register (USBTxPLen) */
#define USBDEV_USBDevIntSt_EP_RLZED					((uint32_t)(1<<8)) 			/**< Endpoints realized */
#define USBDEV_USBDevIntSt_ERR_INT					((uint32_t)(1<<9)) 			/**< Error Interrupt */

/* USB Device Interrupt Enable register */
#define USBDEV_USBDevIntEn_FRAME					((uint32_t)(1<<0)) 			/**< The frame interrupt occurs every 1 ms */
#define USBDEV_USBDevIntEn_EP_FAST					((uint32_t)(1<<1)) 			/**< Fast endpoint interrupt */
#define USBDEV_USBDevIntEn_EP_SLOW					((uint32_t)(1<<2)) 			/**< Slow endpoints interrupt */
#define USBDEV_USBDevIntEn_DEV_STAT					((uint32_t)(1<<3)) 			/**< Set when USB Bus reset, USB suspend change or Connect change event occurs */
#define USBDEV_USBDevIntEn_CCEMTY					((uint32_t)(1<<4)) 			/**< The command code register (USBCmdCode) is empty (New command can be written) */
#define USBDEV_USBDevIntEn_CDFULL					((uint32_t)(1<<5)) 			/**< Command data register (USBCmdData) is full (Data can be read now) */
#define USBDEV_USBDevIntEn_RxENDPKT					((uint32_t)(1<<6)) 			/**< The current packet in the endpoint buffer is transferred to the CPU */
#define USBDEV_USBDevIntEn_TxENDPKT					((uint32_t)(1<<7)) 			/**< The number of data bytes transferred to the endpoint buffer equals the number of
																					bytes programmed in the TxPacket length register (USBTxPLen) */
#define USBDEV_USBDevIntEn_EP_RLZED					((uint32_t)(1<<8)) 			/**< Endpoints realized */
#define USBDEV_USBDevIntEn_ERR_INT					((uint32_t)(1<<9)) 			/**< Error Interrupt */
#define USBDEV_USBDevIntEn_BITMASK					((uint32_t)(0x3FF))			/**< USB Device interrupt bit mask */

/* USB Device Interrupt Clear register */
#define USBDEV_USBDevIntClr_FRAME					((uint32_t)(1<<0)) 			/**< The frame interrupt occurs every 1 ms */
#define USBDEV_USBDevIntClr_EP_FAST					((uint32_t)(1<<1)) 			/**< Fast endpoint interrupt */
#define USBDEV_USBDevIntClr_EP_SLOW					((uint32_t)(1<<2)) 			/**< Slow endpoints interrupt */
#define USBDEV_USBDevIntClr_DEV_STAT				((uint32_t)(1<<3)) 			/**< Set when USB Bus reset, USB suspend change or Connect change event occurs */
#define USBDEV_USBDevIntClr_CCEMTY					((uint32_t)(1<<4)) 			/**< The command code register (USBCmdCode) is empty (New command can be written) */
#define USBDEV_USBDevIntClr_CDFULL					((uint32_t)(1<<5)) 			/**< Command data register (USBCmdData) is full (Data can be read now) */
#define USBDEV_USBDevIntClr_RxENDPKT				((uint32_t)(1<<6)) 			/**< The current packet in the endpoint buffer is transferred to the CPU */
#define USBDEV_USBDevIntClr_TxENDPKT				((uint32_t)(1<<7)) 			/**< The number of data bytes transferred to the endpoint buffer equals the number of
																					bytes programmed in the TxPacket length register (USBTxPLen) */
#define USBDEV_USBDevIntClr_EP_RLZED				((uint32_t)(1<<8)) 			/**< Endpoints realized */
#define USBDEV_USBDevIntClr_ERR_INT					((uint32_t)(1<<9)) 			/**< Error Interrupt */

/* USB Device Interrupt Set register */
#define USBDEV_USBDevIntSet_FRAME					((uint32_t)(1<<0)) 			/**< The frame interrupt occurs every 1 ms */
#define USBDEV_USBDevIntSet_EP_FAST					((uint32_t)(1<<1)) 			/**< Fast endpoint interrupt */
#define USBDEV_USBDevIntSet_EP_SLOW					((uint32_t)(1<<2)) 			/**< Slow endpoints interrupt */
#define USBDEV_USBDevIntSet_DEV_STAT				((uint32_t)(1<<3)) 			/**< Set when USB Bus reset, USB suspend change or Connect change event occurs */
#define USBDEV_USBDevIntSet_CCEMTY					((uint32_t)(1<<4)) 			/**< The command code register (USBCmdCode) is empty (New command can be written) */
#define USBDEV_USBDevIntSet_CDFULL					((uint32_t)(1<<5)) 			/**< Command data register (USBCmdData) is full (Data can be read now) */
#define USBDEV_USBDevIntSet_RxENDPKT				((uint32_t)(1<<6)) 			/**< The current packet in the endpoint buffer is transferred to the CPU */
#define USBDEV_USBDevIntSet_TxENDPKT				((uint32_t)(1<<7)) 			/**< The number of data bytes transferred to the endpoint buffer equals the number of
																					bytes programmed in the TxPacket length register (USBTxPLen) */
#define USBDEV_USBDevIntSet_EP_RLZED				((uint32_t)(1<<8)) 			/**< Endpoints realized */
#define USBDEV_USBDevIntSet_ERR_INT					((uint32_t)(1<<9)) 			/**< Error Interrupt */

