bitboxelectronics/R2C2_Firmware/libraries/NXP/Drivers/include/lpc17xx_usbdev.h
/* USB Device Interrupt Priority register */
#define USBDEV_USBDevIntPri_FRAME					((uint32_t)(1<<0))			/**< FRAME interrupt is routed to USB_INT_REQ_HP */
#define USBDEV_USBDevIntPri_EP_FAST					((uint32_t)(1<<1))			/**< EP_FAST interrupt is routed to USB_INT_REQ_HP */


/* USB Device Endpoint interrupt registers --------------------------------------------------- */
/* USB Endpoint Interrupt Status register */
#define USBDEV_USBEpIntSt_RX(n)						((uint32_t)(n<<1))			/**< Data Received Interrupt bit for EPn */
#define USBDEV_USBEpIntSt_TX(n)						((uint32_t)((n<<1)+1))		/**< Data Transmitted Interrupt bit for EPn */

/* USB Endpoint Interrupt Enable register */
#define USBDEV_USBEpIntEn_RX(n)						((uint32_t)(n<<1))			/**< Data Received Interrupt bit for EPn */
#define USBDEV_USBEpIntEn_TX(n)						((uint32_t)((n<<1)+1))		/**< Data Transmitted Interrupt bit for EPn */

/* USB Endpoint Interrupt Clear register */
#define USBDEV_USBEpIntClr_RX(n)					((uint32_t)(n<<1))			/**< Data Received Interrupt bit for EPn */
#define USBDEV_USBEpIntClr_TX(n)					((uint32_t)((n<<1)+1))		/**< Data Transmitted Interrupt bit for EPn */

/* USB Endpoint Interrupt Set register */
#define USBDEV_USBEpIntSet_RX(n)					((uint32_t)(n<<1))			/**< Data Received Interrupt bit for EPn */
#define USBDEV_USBEpIntSet_TX(n)					((uint32_t)((n<<1)+1))		/**< Data Transmitted Interrupt bit for EPn */

/* USB Endpoint Priority register
 * 0: The corresponding interrupt is routed to the EP_SLOW bit of USBDevIntSt
 * 1: The corresponding interrupt is routed to the EP_FAST bit of USBDevIntSt */
#define USBDEV_USBEpIntPri_RX(n)					((uint32_t)(n<<1))			/**< Data Received Interrupt bit for EPn */
#define USBDEV_USBEpIntPri_TX(n)					((uint32_t)((n<<1)+1))		/**< Data Transmitted Interrupt bit for EPn */


/* Endpoint realization registers ------------------------------------------------------- */
/* USB Realize Endpoint register
 * Note:
 * On reset, only the control endpoints (EP0 and EP1) are realized */
#define USBDEV_USBReEp_EPn(n)						((uint32_t)(1<<n))			/**< Endpoint EPn is realized */

/* USB Endpoint Index register */
#define USBDEV_USBEpIn_PHY_EP(n)					((uint32_t)(n&0x1F))		/**< Physical endpoint number */

/* USB MaxPacketSize register */
#define USBDEV_USBMaxPSize_MPS(n)					((uint32_t)(n&0x3FF))		/**< The maximum packet size value */


/* USB transfer registers -------------------------------------------------------------- */
/* USB Receive Data register */
/* USB Receive Packet Length register */
#define USBDEV_USBRxPLen_PKT_LNGTH_MASK				((uint32_t)(0x3FF))			/**< The remaining number of bytes to be read from the
																				currently selected endpoint’s buffer */
#define USBDEV_USBRxPLen_DV							((uint32_t)(1<<10))			/**< Data Valid */
#define USBDEV_USBRxPLen_PKT_RDY					((uint32_t)(1<<11))			/**< The PKT_LNGTH field is valid and the packet is
																				ready for reading */
/* USB Transmit Data register */
/* USB Transmit Packet Length register */
#define USBDEV_USBTxPLen_PKT_LNGTH_MASK				((uint32_t)(0x3FF))			/**< The remaining number of bytes to be written to
																				the selected endpoint buffer */
/* USB Control register */
#define USBDEV_USBCtrl_RD_EN						((uint32_t)(1<<0))			/**< Read mode control */
#define USBDEV_USBCtrl_WR_EN						((uint32_t)(1<<1))			/**< Write mode control */
#define USBDEV_USBCtrl_LOG_ENDPOINT(n)				((uint32_t)((n&0F)<<2))		/**< Logical Endpoint number */


/* SIE (Serial Interface Engine) command code registers ----------------------------------------------------------- */
/* USB Command Code register */
#define USBDEV_USBCmdCode_CMD_PHASE(n)				((uint32_t)((n&0xFF)<<8))			/**< The command phase */
#define USBDEV_USBCmdCode_CMD_PHASE_READ			USBDEV_USBCmdCode_CMD_PHASE(0x02)	/**< Read */
#define USBDEV_USBCmdCode_CMD_PHASE_WRITE			USBDEV_USBCmdCode_CMD_PHASE(0x01)	/**< Write */
#define USBDEV_USBCmdCode_CMD_PHASE_COMMAND			USBDEV_USBCmdCode_CMD_PHASE(0x05)	/**< Command */

#define USBDEV_USBCmdCode_CMD_CODE(n)				((uint32_t)((n&0xFF)<<16))			/**< Command Code field */
#define USBDEV_USBCmdCode_CMD_WDATA(n)				((uint32_t)((n&0xFF)<<16))			/**< Write Data field */


/* USB Command Data register */
#define USBDEV_USBCmdData_CMD_RDATA(n)				((uint32_t)(n&0xFF))				/**< Command Read Data */


/* SIE (Serial Interface Engine) command code definitions --------------------------------------------- */
/* Device command */
#define SIECMD_DEV_SET_ADDR							(0xD0) 		/**< Set address command */
#define SIECMD_DEV_CFG_DEV							(0xD8) 		/**< Configure device command */
#define SIECMD_DEV_SET_MODE							(0xF3) 		/**< Set mode command */
#define SIECMD_DEV_RD_FRAME							(0xF5) 		/**< Read current frame number command */
#define SIECMD_DEV_RD_TEST							(0xFD)		/**< Read test register command */
#define SIECMD_DEV_SET_STAT							(0xFE) 		/**< Set device status command */
#define SIECMD_DEV_GET_STAT							(0xFE) 		/**< Get device status command */
#define SIECMD_DEV_GET_ERR_CODE						(0xFF) 		/**< Get error code command */
#define SIECMD_DEV_RD_ERR_STAT						(0xFB) 		/**< Read error status command */
/* EndPoint commands */
#define SIECMD_EP_SEL(n)							(n) 		/**< Select endpoint command */
#define SIECMD_EP_CLRI(n)							(0x40+n) 	/**< Select endpoint/clear interrupt command */
#define SIECMD_EP_SET_STAT(n)						(0x40+n)	/**< Set endpoint status command */
#define SIECMD_EP_CLR_BUF							(0xF2) 		/**< Clear the buffer command */
#define SIECMD_EP_VALID_BUF							(0xFA) 		/**< Validate the buffer command */


/* SIE Command implementation -------------------------------------------------------------- */
/* Set address command */
#define DEV_ADDR(n)									(n&0x7F) 	/**< Device address set by software */
#define DEV_EN										(1<<7) 		/**< Device enable */

/* Configure device command */
#define CONF_DEVICE									(1<<0) 		/**< Device is configured */

/* Set mode command */
#define AP_CLK										(1<<0) 		/**< Always PLL clock */
#define INAK_CI										(1<<1) 		/**< Interrupt on NAK for Control IN endpoint */
#define INAK_CO										(1<<2) 		/**< Interrupt on NAK for Control OUT endpoint */
#define INAK_II										(1<<3) 		/**< Interrupt on NAK for Interrupt IN endpoint */
#define INAK_IO										(1<<4) 		/**< Interrupt on NAK for Interrupt OUT endpoint */
#define INAK_BI										(1<<5) 		/**< Interrupt on NAK for Bulk IN endpoint */
#define INAK_BO										(1<<6) 		/**< Interrupt on NAK for Bulk OUT endpoint */

