bitboxelectronics/R2C2_Firmware/libraries/NXP/Drivers/include/lpc17xx_usbdev.h
/* Read current frame number command */

/* Read test register command */

/* Set/Get device status command */
#define CON											(1<<0) 		/**< Indicate the current connect status of the device */
#define CON_CH										(1<<1) 		/**< Connect change */
#define SUS											(1<<2) 		/**< Suspend */
#define SUS_CH										(1<<3) 		/**< Suspend bit change indicator */
#define RST											(1<<4) 		/**< Bus reset bit */

/*
 * Get error code command
 * Error Code descriptions:
 *  - 0000 No Error.
 *  - 0001 PID Encoding Error.
 *  - 0010 Unknown PID.
 *  - 0011 Unexpected Packet - any packet sequence violation from the
 * 		specification.
 *  - 0100 Error in Token CRC.
 *  - 0101 Error in Data CRC.
 *  - 0110 Time Out Error.
 *  - 0111 Babble.
 *  - 1000 Error in End of Packet.
 *  - 1001 Sent/Received NAK.
 *  - 1010 Sent Stall.
 *  - 1011 Buffer Overrun Error.
 *  - 1100 Sent Empty Packet (ISO Endpoints only).
 *  - 1101 Bitstuff Error.
 *  - 1110 Error in Sync.
 *  - 1111 Wrong Toggle Bit in Data PID, ignored data.
 *  - Bit 4 : EA - The Error Active bit will be reset once this register is read.
 */

/* Read error status command */
#define ERR_PID										(1<<0) 		/**< PID encoding error or Unknown PID or Token CRC */
#define ERR_UEPKT									(1<<1) 		/**< Unexpected packet */
#define ERR_DCRC									(1<<2) 		/**< Data CRC error */
#define ERR_TIMEOUT									(1<<3) 		/**< Timeout error */
#define ERR_EOP										(1<<4) 		/**< End of packet error */
#define ERR_B_OVRN									(1<<5) 		/**< Buffer overrun */
#define ERR_BTSTF									(1<<6) 		/**< Bit stuff error */
#define ERR_TGL_ERR									(1<<7) 		/**< Wrong toggle bit in data PID, ignored data */


/* Select Endpoint command */
#define EPSTAT_FE									(1<<0) 		/**< For the F/E bit give the ORed result
																	of B_1_FULL and B_2_FULL bits*/
#define EPSTAT_ST									(1<<1) 		/**< Stalled endpoint indicator*/
#define EPSTAT_STP									(1<<2) 		/**< Setup bit */
#define EPSTAT_PO									(1<<3) 		/**< Packet over-written bit */
#define EPSTAT_EPN									(1<<4) 		/**< EP NAKed bit indicates sending of a NAK */
#define EPSTAT_B1FULL								(1<<5) 		/**< Buffer 1 status: Full */
#define EPSTAT_B2FULL								(1<<6) 		/**< Buffer 2 status: Full */

/* Select Endpoint/Clear Interrupt command */

/* Set Endpoint Status command */
#define EP_ST										(1<<0) 		/**< Stalled endpoint bit */
#define EP_DA										(1<<5) 		/**< Disable endpoint bit */
#define EP_RF_MO									(1<<6) 		/**< Rate feedback mode */
#define EP_CND_ST									(1<<7) 		/**< Conditional stall bit */

/* Clear buffer command */
#define CLR_BUF_PO									(1<<0)		/**< Packet over-written bit */


/* DMA registers --------------------------------------------------------------------------------------- */
/* USB DMA Request Status register */
#define USBDEV_USBDMARSt_EPn(n)						((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))	/**< DMA requested by endpoint n */

/* USB DMA Request Clear register */
#define USBDEV_USBDMARClr_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))	/**< Clear the endpoint n DMA request */

/* USB DMA Request Set register */
#define USBDEV_USBDMARSet_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))	/**< Set the endpoint n DMA request */

/* USB UDCA (USB Device Communication Area) Head register */
#define USBDEV_USBUDCAH_UDCA_ADDR(n)				((uint32_t)(n&0xFFFFFF00))						/**< Start address of the UDCA */

/* USB Endpoint DMA Status register */
#define USBDEV_USBEpDMASt_EPn_DMA_ENABLE(n)			((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))	/**< The DMA for endpoint EPn is enabled */

/* USB Endpoint DMA Enable register */
#define USBDEV_USBEpDMAEn_EPn_DMA_ENABLE(n)			((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))	/**< Enable the DMA operation for endpoint EPn */

/* USB Endpoint DMA Disable register */
#define USBDEV_USBEpDMADis_EPn_DMA_DISABLE(n)		((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))	/**< Disable the DMA operation for endpoint EPn */

/* USB DMA Interrupt Status register */
#define USBDEV_USBDMAIntSt_EOT						((uint32_t)(1<<0))			/**< End of Transfer Interrupt bit */
#define USBDEV_USBDMAIntSt_NDDR						((uint32_t)(1<<1))			/**< New DD Request Interrupt bit */
#define USBDEV_USBDMAIntSt_ERR						((uint32_t)(1<<2))			/**< System Error Interrupt bit */

/* USB DMA Interrupt Enable register */
#define USBDEV_USBDMAIntEn_EOT						((uint32_t)(1<<0))			/**< End of Transfer Interrupt Enable bit */
#define USBDEV_USBDMAIntEn_NDDR						((uint32_t)(1<<1))			/**< New DD Request Interrupt Enable bit */
#define USBDEV_USBDMAIntEn_ERR						((uint32_t)(1<<2))			/**< System Error Interrupt Enable bit */

/* USB End of Transfer Interrupt Status register */
#define USBDEV_USBEoTIntSt_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Endpoint n End of Transfer Interrupt request */

/* USB End of Transfer Interrupt Clear register */
#define USBDEV_USBEoTIntClr_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Clear endpoint n End of Transfer Interrupt request */

/* USB End of Transfer Interrupt Set register */
#define USBDEV_USBEoTIntSet_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Set endpoint n End of Transfer Interrupt request */

/* USB New DD Request Interrupt Status register */
#define USBDEV_USBNDDRIntSt_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Endpoint n new DD interrupt request */

/* USB New DD Request Interrupt Clear register */
#define USBDEV_USBNDDRIntClr_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Clear endpoint n new DD interrupt request */

/* USB New DD Request Interrupt Set register */
#define USBDEV_USBNDDRIntSet_EPn(n)					((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Set endpoint n new DD interrupt request */

/* USB System Error Interrupt Status register */
#define USBDEV_USBSysErrIntSt_EPn(n)				((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Endpoint n System Error Interrupt request */

/* USB System Error Interrupt Clear register */
#define USBDEV_USBSysErrIntClr_EPn(n)				((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Clear endpoint n System Error Interrupt request */

/* USB System Error Interrupt Set register */
#define USBDEV_USBSysErrIntSet_EPn(n)				((uint32_t)(((n>=2)&&(n<=31)) ? (1<<n) : (0)))		/**< Set endpoint n System Error Interrupt request */


