bitboxelectronics/R2C2_Firmware/libraries/NXP/Drivers/include/lpc17xx_usbdev.h
/* USB DMA Implementation -------------------------------------------------------------------- */
/* USB RAM Definitions */
#define USB_RAM_ADR     (0x20080000)  						/**< USB RAM Start Address */
#define USB_RAM_SZ      (0x00004000)  						/**< USB RAM Size (16kB) */


/* DMA Endpoint Descriptors */
#define DD_NISO_CNT      	(16)  							/**< Non-Iso EP DMA Descriptor Count (max. 32) */
#define DD_ISO_CNT        	(8)  								/**< Iso EP DMA Descriptor Count (max. 32) */
#define DD_NISO_SZ    		(DD_NISO_CNT * 16)    			/**< Non-Iso DMA Descriptor Size */
#define DD_ISO_SZ     		(DD_ISO_CNT  * 20)    			/**< Iso DMA Descriptor Size */
#define DD_NISO_ADR   		(USB_RAM_ADR + 128)   			/**< Non-Iso DMA Descriptor Address */
#define DD_ISO_ADR    		(DD_NISO_ADR + DD_NISO_SZ) 		/**< Iso DMA Descriptor Address */
#define DD_SZ           	(128 + DD_NISO_SZ + DD_ISO_SZ) 	/**< Descriptor Size */

/* DMA Buffer Memory Definitions */
#define DMA_BUF_ADR   		(USB_RAM_ADR + DD_SZ) 			/**< DMA Buffer Start Address */
#define DMA_BUF_SZ    		(USB_RAM_SZ  - DD_SZ) 			/**< DMA Buffer Size */


/* Other USB Device Hardware Configurations --------------------------------------------------------- */
/* USB CONFIGURATION */
#define USB_EP_NUM          (32)		/**< USB EP number */
#define USB_MAX_PACKET0     (64)		/**< Maximum packet size for EP 0 */
#define MAX_PACKET_SIZE0	(64)		/**< Maximum packet size for EP 0 */

/* Some other useful macros */
#define MIN(x,y)	((x)<(y)?(x):(y))	/**< MIN macro */
#define MAX(x,y)	((x)>(y)?(x):(y))	/**< MAX macro */

/* Extern macro defines for debugging */
#define nextline	/**< Extern macro defines for debugging: Next line debug command */
#define DBG(x)		/**< Extern macro defines for debugging: String debug command */
#define DBC(x)		/**< Extern macro defines for debugging: Number debug command */
#define ASSERT(x)	/**< Extern macro defines for debugging: Assert command */

/**
 * @}
 */


/**
 * @}
 */


/**************************** GLOBAL/PUBLIC TYPES ***************************/

/**
 * @addtogroup PUBLIC_TYPES
 * @{
 */

/** @defgroup USBDEV_TYPES
 * @{
 */


/**
 * @brief Setup Packet Definitions
 */
typedef struct __attribute__ ((__packed__)) {
	uint8_t	bmRequestType;			/**< characteristics of the specific request */
	uint8_t	bRequest;				/**< specific request */
	uint16_t wValue;				/**< request specific parameter */
	uint16_t wIndex;				/**< request specific parameter */
	uint16_t wLength;				/**< length of data transferred in data phase */
} USB_SETUP_PACKET;


/**
 * @brief USB Descriptor Header
 */
typedef struct __attribute__ ((__packed__)) {
	uint8_t	bLength;				/**< descriptor length */
	uint8_t	bDescriptorType;		/**< descriptor type */
} USB_DESC_HEADER;


#if _USB_DMA
/**
 * @brief DMA Descriptor Data Structure
 */
typedef struct __attribute__ ((__packed__)) {
	__IO uint32_t UDCA[USB_EP_NUM];						/**< USB Device Communication Area memory */
	__IO uint32_t DD_NISO_Mem[4*DD_NISO_CNT];           /**< Non-Iso DMA Descriptor Memory */
	__IO uint32_t DD_ISO_Mem [5*DD_ISO_CNT];            /**< Iso DMA Descriptor Memory */
	__IO uint32_t BUF_ADR; 								/**< The start address to buffer the data */
} USB_DMA_T;


/**
 * @brief  USB DMA Descriptor Option Structure
 */
typedef struct __attribute__ ((__packed__)) _USB_DMA_OPTS {
	uint32_t Link   : 1;             /**< Link to existing Descriptors */
	uint32_t IsoEP  : 1;             /**< Isonchronous Endpoint */
	uint32_t ATLE   : 1;             /**< ATLE (Auto Transfer Length Extract) */
	uint32_t Rsrvd  : 5;             /**< Reserved */
	uint32_t LenPos : 8;             /**< Length Position (ATLE) */
} USB_DMA_OPTS;

/**
 * @brief  USB DMA Descriptor Structure
 */

typedef struct __attribute__ ((__packed__)) _USB_DMA_DESCRIPTOR {
  uint32_t 	BufAdr;                     	/**< DMA Buffer Address */
  uint16_t  BufLen;                     	/**< DMA Buffer Length */
  uint16_t  MaxSize;                    	/**< Maximum Packet Size */
  uint32_t 	InfoAdr;                    	/**< Packet Info Memory Address */
  union __attribute__ ((__packed__)) {
	USB_DMA_OPTS Type;						/**< DMA Option in bit-field type value */
	uint32_t Val;							/**< DMA Option value */
  } Cfg;									/**< DMA Configuration */
} USB_DMA_DESCRIPTOR;
#endif /* _USB_DMA */

extern uint8_t ep_configured;

/* USB EndPoint Call Back Function type */
typedef void (USB_EPIntHandler)(uint8_t bEP, uint8_t bEPStatus);

/* USB Device Status Event Call Back Function type */
typedef void (USB_DevIntHandler)(uint8_t bDevStatus);

/* USB Frame Event Call Back Function type */
typedef void (USB_FrameHandler)(uint16_t wFrame);

/* USB DMA EP Event Call Back Function type */
typedef void (USB_DMA_EPIntHandler)(uint8_t bEP, uint32_t wStatus);

/* USB Device Request Handler type */
typedef Bool (USB_HandleRequest)(USB_SETUP_PACKET *pSetup, int32_t *piLen, uint8_t **ppbData);

/**
 * @}
 */

/**
 * @}
 */


/*************************** GLOBAL/PUBLIC MACROS ***************************/

/**
 * @addtogroup PUBLIC_MACROS
 * @{
 */

/** @defgroup USBDEV_PUBLIC_MACROS
 * @{
 */


/* USB Endpoint CallBack Events Type ---------------------------------------------- */
#define USB_EVT_SETUP       (1)   /**< Setup Packet */
#define USB_EVT_OUT         (2)   /**< OUT Packet */
#define USB_EVT_IN          (3)   /**< IN Packet */
#define USB_EVT_OUT_NAK     (4)   /**< OUT Packet - Not Acknowledged */
#define USB_EVT_IN_NAK      (5)   /**< IN Packet - Not Acknowledged */
#define USB_EVT_OUT_STALL   (6)   /**< OUT Packet - Stalled */
#define USB_EVT_IN_STALL    (7)   /**< IN Packet - Stalled */
#define USB_EVT_OUT_DMA_EOT (8)   /**< DMA OUT EP - End of Transfer */
#define USB_EVT_IN_DMA_EOT  (9)   /**< DMA IN EP - End of Transfer */
#define USB_EVT_OUT_DMA_NDR (10)  /**< DMA OUT EP - New Descriptor Request */
#define USB_EVT_IN_DMA_NDR  (11)  /**< DMA IN EP - New Descriptor Request */
#define USB_EVT_OUT_DMA_ERR (12)  /**< DMA OUT EP - Error */
#define USB_EVT_IN_DMA_ERR  (13)  /**< DMA IN EP - Error */

/* USB Endpoint Status (sent through CallBack) ------------------------------------ */
#define EP_STATUS_DATA		(1<<0)		/**< EP has data */
#define EP_STATUS_STALLED	(1<<1)		/**< EP is stalled */
#define EP_STATUS_SETUP		(1<<2)		/**< EP received setup packet */
#define EP_STATUS_ERROR		(1<<3)		/**< EP data was overwritten by setup packet */
#define EP_STATUS_NACKED	(1<<4)		/**< EP sent NAK */

