bitboxelectronics/R2C2_Firmware/libraries/NXP/Drivers/include/lpc17xx_usbdev.h
/* USB Device Status (Sent through CallBack) ------------------------------------- */
#define DEV_STATUS_CONNECT		(1<<0)	/**< Device just got connected */
#define DEV_STATUS_SUSPEND		(1<<2)	/**< Device entered suspend state */
#define DEV_STATUS_RESET		(1<<4)	/**< Device just got reset */

/* USB Interrupt Type for NAK events --------------------------------------------- */
#define INACK_CI			(1<<1)			/**< Interrupt on NACK for control in */
#define INACK_CO			(1<<2)			/**< Interrupt on NACK for control out */
#define INACK_II			(1<<3)			/**< Interrupt on NACK for Interrupt in */
#define INACK_IO			(1<<4)			/**< Interrupt on NACK for Interrupt out */
#define INACK_BI			(1<<5)			/**< Interrupt on NACK for bulk in */
#define INACK_BO			(1<<6)			/**< Interrupt on NACK for bulk out */

/* USB Error Codes -------------------------------------------------------------- */
#define USB_ERR_PID         (0x0001)  /**< PID Error */
#define USB_ERR_UEPKT       (0x0002)  /**< Unexpected Packet */
#define USB_ERR_DCRC        (0x0004)  /**< Data CRC Error */
#define USB_ERR_TIMOUT      (0x0008)  /**< Bus Time-out Error */
#define USB_ERR_EOP         (0x0010)  /**< End of Packet Error */
#define USB_ERR_B_OVRN      (0x0020)  /**< Buffer Overrun */
#define USB_ERR_BTSTF       (0x0040)  /**< Bit Stuff Error */
#define USB_ERR_TGL         (0x0080)  /**< Toggle Bit Error */

/* USB DMA Status Codes -------------------------------------------------------- */
#define USB_DMA_INVALID     (0x0000)  /**< DMA Invalid - Not Configured */
#define USB_DMA_IDLE        (0x0001)  /**< DMA Idle - Waiting for Trigger */
#define USB_DMA_BUSY        (0x0002)  /**< DMA Busy - Transfer in progress */
#define USB_DMA_DONE        (0x0003)  /**< DMA Transfer Done (no Errors)*/
#define USB_DMA_OVER_RUN    (0x0004)  /**< Data Over Run */
#define USB_DMA_UNDER_RUN   (0x0005)  /**< Data Under Run (Short Packet) */
#define USB_DMA_ERROR       (0x0006)  /**< Error */
#define USB_DMA_UNKNOWN     (0xFFFF)  /**< Unknown State */

/* Macro used in USB Request Handler ------------------------------------------- */
#define REQTYPE_GET_DIR(x)		(((x)>>7)&0x01)		/**< Get Request Direction: To Host or To Device */
#define REQTYPE_GET_TYPE(x)		(((x)>>5)&0x03)		/**< Get Request Type */
#define REQTYPE_GET_RECIP(x)	((x)&0x1F)			/**< Get Request Recipient */

#define REQTYPE_DIR_TO_DEVICE	(0)					/**< Request Direction is To Device */
#define REQTYPE_DIR_TO_HOST		(1)					/**< Request Direction is To Host */

#define REQTYPE_TYPE_STANDARD	(0)					/**< Standard Request Type */
#define REQTYPE_TYPE_CLASS		(1)					/**< Class Request Type */
#define REQTYPE_TYPE_VENDOR		(2)					/**< Vendor Request Type */
#define REQTYPE_TYPE_RESERVED	(3)					/**< Reserved Request Type */

#define REQTYPE_RECIP_DEVICE	(0)					/**< Request Recipient type: Device */
#define REQTYPE_RECIP_INTERFACE	(1)					/**< Request Recipient type: Interface */
#define REQTYPE_RECIP_ENDPOINT	(2)					/**< Request Recipient type: EndPoint */
#define REQTYPE_RECIP_OTHER		(3)					/**< Request Recipient type: Other */

/* Standard requests definitions ------------------------------------------------ */
#define	REQ_GET_STATUS			(0x00)				/**< Get Status Request */
#define REQ_CLEAR_FEATURE		(0x01)				/**< Clear Feature Request */
#define REQ_SET_FEATURE			(0x03)				/**< Set Feature Request */
#define REQ_SET_ADDRESS			(0x05)				/**< Set Address Request */
#define REQ_GET_DESCRIPTOR		(0x06)				/**< Get Descriptor Request */
#define REQ_SET_DESCRIPTOR		(0x07)				/**< Set Descriptor Request */
#define REQ_GET_CONFIGURATION	(0x08)				/**< Set Configuration Request */
#define REQ_SET_CONFIGURATION	(0x09)				/**< Set Configuration Request */
#define REQ_GET_INTERFACE		(0x0A)				/**< Get Interface Request */
#define REQ_SET_INTERFACE		(0x0B)				/**< Set Interface Request */
#define REQ_SYNCH_FRAME			(0x0C)				/**< Synchronous Frame Request */

/* Class requests HID definitions ---------------------------------------------- */
#define HID_GET_REPORT			(0x01)				/**< HID Get Report Request */
#define HID_GET_IDLE			(0x02)				/**< HID Get Idle Request */
#define HID_GET_PROTOCOL	 	(0x03)				/**< HID Get Protocol Request */
#define HID_SET_REPORT			(0x09)				/**< HID Set Protocol Request */
#define HID_SET_IDLE			(0x0A)				/**< HID Set Idle Request */
#define HID_SET_PROTOCOL		(0x0B)				/**< HID Set Protocol Request */

/* Feature selectors definitions ---------------------------------------------- */
#define FEA_ENDPOINT_HALT		(0x00)				/**< Halt EP feature */
#define FEA_REMOTE_WAKEUP		(0x01)				/**< Remote WakeUp feature */
#define FEA_TEST_MODE			(0x02)				/**< Test mode feature */


/* USB Descriptor definitions -------------------------------------------------- */
#define DESC_DEVICE				(1)					/**< Device Descriptor */
#define DESC_CONFIGURATION		(2)					/**< Configuration Descriptor */
#define DESC_STRING				(3)					/**< String Descriptor */
#define DESC_INTERFACE			(4)					/**< Interface Descriptor */
#define DESC_ENDPOINT			(5)					/**< EndPoint Descriptor */
#define DESC_DEVICE_QUALIFIER	(6)					/**< Device Qualifier Descriptor */
#define DESC_OTHER_SPEED		(7)					/**< Other Speed Descriptor */
#define DESC_INTERFACE_POWER	(8)					/**< Interface Power Descriptor */

#define DESC_HID_HID			(0x21)				/**< HID Descriptor */
#define DESC_HID_REPORT			(0x22)				/**< HID Report Descriptor */
#define DESC_HID_PHYSICAL		(0x23)				/**< HID Physical Descriptor */

#define GET_DESC_TYPE(x)		(((x)>>8)&0xFF)		/**< Get Descriptor Type */
#define GET_DESC_INDEX(x)		((x)&0xFF)			/**< Get Descriptor Index */


/**
 * @}
 */

/**
 * @}
 */



/************************** GLOBAL/PUBLIC FUNCTIONS *************************/

/**
 * @addtogroup PUBLIC_FUNCTION_PROTOTYPES
 * @{
 */

/** @defgroup USBDEV_FUNCTIONS
 * @{
 */


/* USB Hardware Function Section --------------------------------------------- */
void USBDEV_Init(void);
void USBDEV_DeInit(void);
void USBDEV_SetAddress(uint8_t bAddr);
void USBDEV_Connect(FunctionalState NewState);


/* USB EndPoint Function Section --------------------------------------------- */
void USBDEV_EPRealize(uint8_t bEP, uint16_t wMaxPSize);
void USBDEV_EPCmd(uint8_t bEP, FunctionalState NewState);
void USBDEV_EPConfig(uint8_t bEP, uint16_t wMaxPacketSize);
void USBDEV_EPIntCmd(uint8_t bEP, FunctionalState NewState);
uint8_t USBDEV_EPGetStatus(uint8_t bEP);
void   USBDEV_EPStallCmd(uint8_t bEP, FunctionalState NewState);
int32_t USBDEV_EPWrite(uint8_t bEP, uint8_t *pbBuf, int32_t iLen);
int32_t USBDEV_EPRead(uint8_t bEP, uint8_t *pbBuf, int32_t iMaxLen);
uint32_t USBDEV_EPIsoWrite(uint32_t EPNum, uint8_t *pData, uint32_t cnt);
uint32_t USBDEV_EPIsoRead(uint32_t EPNum, uint8_t *pData);


/* USB Call Back Function Configuration Section ----------------------------- */
/* USB EndPoint Call Back Function */
void USBDEV_EPSetupCBS(uint8_t bEP, USB_EPIntHandler *pfnHandler);

