bitboxelectronics/R2C2_Firmware/libraries/NXP/Drivers/include/lpc17xx_usbdev.h
/* USB Device Event Call Back Function */
void USBDEV_DeviceSetupCBS(USB_DevIntHandler *pfnHandler);

/* USB Frame Event Call Back Function */
void USBDEV_FrameSetupCBS(USB_FrameHandler *pfnHandler);

/* Default USB Device CallBack Function Initialization */
void USBDEV_InitDefaultCBS(void);

/* Standard USB IRQ Handler */
void USBDEV_StandardIRQHandler(void);

/* USB Device Reset handler */
void USBDEV_ResetHandler(uint8_t bDevStatus);


/* Other USB Device Configurations Section --------------------------------- */
void USBDEV_NAKIntConfig(uint8_t bIntBits);
void USBDEV_DeviceConfigCmd(FunctionalState NewState);


/* USB DMA functionalities section -------------------------------------------- */
#if _USB_DMA
void USBDEV_DMAEPSetupCBS(uint8_t bEP, USB_DMA_EPIntHandler *pfnHandler);
Bool USBDEV_DMAEPSetup(uint8_t bEP, USB_DMA_DESCRIPTOR *pDD) ;
void USBDEV_DMAEPCmd (uint8_t bEP, FunctionalState NewState) ;
uint32_t USBDEV_DMAEPGetStatus (uint8_t bEP) ;
uint32_t USBDEV_DMAEPGetBufAdr (uint8_t bEP) ;
uint32_t USBDEV_DMAEPGetBufCnt (uint8_t bEP) ;
#endif /* _USB_DMA */


/* USB Device Application Interface Function Declarations (Middle Ware Layer)---------------------------- */
/* USB Device EP0 (Control) handler */
void USBDEV_ControlHandler(uint8_t bEP, uint8_t bEPStat);

/* USB Device Request Handler */
void USBDEV_RequestHandlerSetupCBS(int32_t iType, USB_HandleRequest *pfnHandler, uint8_t *pbDataStore);
Bool USBDEV_StandardRequestHandler(USB_SETUP_PACKET *pSetup, int32_t *piLen, uint8_t **ppbData);
void USBDEV_CustomRequestHandlerSetupCBS(USB_HandleRequest *pfnHandler);

/* USB Device Descriptor Handler  */
void USBDEV_RegisterDescriptor(const uint8_t *pabDescriptors);
uint8_t USBDEV_GetCurrentConfiguration(void);
uint8_t USBDEV_GetCurrentInterface(void);
uint8_t USBDEV_GetCurrentAlternateSetting(void);
Bool USBDEV_GetDescriptor(uint16_t wTypeIndex, uint16_t wLangID, int32_t *piLen, uint8_t **ppbData);


/**
 * @}
 */

/**
 * @}
 */


#ifdef __cplusplus
}
#endif

#endif /* LPC17XX_USBDEV_H_ */
